load-test/test-carts-getCartItems.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: 'http://localhost:3000/api'
  phases:
    - duration: 20
      arrivalRate: 30
      rampTo: 50
      name: Warm up phase
    - duration: 20
      arrivalRate: 50
      rampTo: 75
      name: Ramp up load
    - duration: 20
      arrivalRate: 80
      rampTo: 35
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  # plugins:
  #     ensure: {}
  #     apdex: {}
  #     metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
  payload:
   - path: "fake_data_cart.csv"
     fields: 
        - "cartId"
        - "goodsId"
        - "createCartDtoCtCount"
        - "updateCount"
   - path: "fake_data_token.csv"
     fields:
        - "accessToken"

scenarios:
  - name: "3-2. [Carts][getCartItems] - 10,000VUs"
    flow:
      - log: "{{ accessToken }}"
      - get:
          url: "/cart"
          cookie:
            authorization: "{{ accessToken }}"