load-test/test-payments-findOneOrderByBoth.yaml
config:
  target: 'http://localhost:3000/api'
  phases:
    - duration: 20
      arrivalRate: 30
      rampTo: 50
      name: Warm up phase
    - duration: 20
      arrivalRate: 50
      rampTo: 75
      name: Ramp up load
    - duration: 20
      arrivalRate: 80
      rampTo: 35
      name: Spike phase
  # plugins:
  #     ensure: {}
  #     apdex: {}
  #     metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
  payload:
   - path: "fake_data_payments.csv"
     fields: 
       - "paymentId"
   - path: "fake_data_token.csv"
     fields:
        - "accessToken"

scenarios:
  - name: "5-3. [Payments][findOneOrderByBoth(무슨 뜻이지)] - 100,000VUs"
    flow:
      - log: "{{ paymentId }}, {{ accessToken }}"
      - get:
          url: "/payments/{{ paymentId }}"
          cookie:
            authorization: "{{ accessToken }}"

# scenarios:
#   - name: "5-2. [Payments][findAllOrderByUser] - 100,000VUs"
#     flow:
#       - get:
#           url: "/payments/user"
#           cookie:
#             authorization: "{{ accessToken }}"